ab_test_data/rest_large.txt
C:\Users\ryzen>ab -g rest_large.data -l -n 1000 -c 10 http://localhost:8080/rest/unary/user/100
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            8080

Document Path:          /rest/unary/user/100
Document Length:        Variable

Concurrency Level:      10
Time taken for tests:   13.561 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      13154187 bytes
HTML transferred:       13056187 bytes
Requests per second:    73.74 [#/sec] (mean)
Time per request:       135.609 [ms] (mean)
Time per request:       13.561 [ms] (mean, across all concurrent requests)
Transfer rate:          947.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0      16
Processing:    14  135  80.5    125     636
Waiting:        0   46  60.8     22     357
Total:         14  135  80.6    125     636

Percentage of the requests served within a certain time (ms)
  50%    125
  66%    141
  75%    155
  80%    166
  90%    218
  95%    335
  98%    377
  99%    412
 100%    636 (longest request)

C:\Users\ryzen>